CF/Reports/КонтрольКассовойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>КонтрольКассовойКниги</Name>
		</Properties>
	</Report>
</MetaDataObject>

CF/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыПоВедомостям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаПоИмпорту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплектацияНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеПоИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаНаВнутренниеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровДоРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровПослеРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересортицаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересортицаТоваровСПереоценкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПодарочныхСертификатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемТоваровОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПоИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеКомиссионныхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВознаграждениеОтКомитента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Documents/КассоваяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>КассоваяКнига</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЛистовКассовойКниги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераЛистов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПлатежныхАгентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассовыеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассовыйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорреспондирующийСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Reports/КонтрольКассовойКниги/Forms/КонтрольКассовойКниги/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Магазин") Тогда
		Магазин = Параметры.Магазин;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация   = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация, Ответственный);
	
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(,,Организация);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТабДок;
	
	Элементы.ТабДок.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.ТабДок.ОтображениеСостояния.Текст = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'");
	Элементы.ТабДок.ОтображениеСостояния.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПроверкиПриИзменении(Элемент)
	УстановитьНеАктуальностьРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьНеАктуальностьРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Прав(ДанныеСобытия.Href, 22) = "ЗапуститьПеренумерацию" Тогда
		ЗапуститьПеренумерацию();
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Позиция = Найти(ДанныеСобытия.Href, "e1cib");
		Ссылка = Сред(ДанныеСобытия.Href,Позиция);
		
		ПерейтиПоНавигационнойСсылке(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	СформироватьНаСервере();
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПолеHTML;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКПеренумерации.Очистить();
	ДанныеПроверки = ДанныеПроверки();
	ЕстьОшибки = Ложь;
	
	ТекстHTML = "<html>
	|<head>
	|<meta http-equiv=""Content-Language"" content=""ru"">
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=windows-1251"">
	|</head>
	|<body>";
	
	// Документы, которые необходимо внести в кассовую книгу.
	Если НЕ ДанныеПроверки[3].Пустой() Тогда
		ТекстHTML = ТекстHTML + "<h3><p style=""margin-bottom: 0""><b>Необходимо внести в кассовую книгу: </b></p></h3>";
		ВыборкаДокументов = ДанныеПроверки[3].Выбрать();
			Пока ВыборкаДокументов.Следующий() Цикл
				НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаДокументов.Ссылка);
				ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0""><a href="+НавигационнаяСсылка+">" 
				+ ВыборкаДокументов.Представление + "</a></p>";
			КонецЦикла;
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	// Непроведенные ПКО и РКО, которые уже внесены в кассовую книгу.
	Если НЕ ДанныеПроверки[4].Пустой() Тогда
		ТекстHTML = ТекстHTML + "<h3><p style=""margin-bottom: 0""><b>Не проведенные документы в кассовой книге: </b></p></h3>";
		ВыборкаКассовыхЛистов = ДанныеПроверки[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКассовыхЛистов.Следующий() Цикл
				НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаКассовыхЛистов.КассоваяКнига);
				ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0""><a href="+НавигационнаяСсылка+">" 
				+ ВыборкаКассовыхЛистов.КассоваяКнигаПредставление + "</a></p>";
				
				
				ВыборкаПоДокументам = ВыборкаКассовыхЛистов.Выбрать();
				Пока ВыборкаПоДокументам.Следующий() Цикл
					НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаПоДокументам.Документ);
					ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0"">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="+НавигационнаяСсылка+">" 
					+ ВыборкаПоДокументам.ДокументПредставление + "</a></p>";
				КонецЦикла;
				
			КонецЦикла;
		ЕстьОшибки = Истина;
	КонецЕсли;

	// Не совпадают суммы в кассовой книге и ПКО или РКО.
	Если НЕ ДанныеПроверки[5].Пустой() Тогда
		ТекстHTML = ТекстHTML + "<h3><p style=""margin-bottom: 0""><b>Сумма документа отличается от суммы в листе кассовой книги: </b></p></h3>";
		ВыборкаКассовыхЛистов = ДанныеПроверки[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКассовыхЛистов.Следующий() Цикл
				НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаКассовыхЛистов.КассоваяКнига);
				ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0""><a href="+НавигационнаяСсылка+">" 
				+ ВыборкаКассовыхЛистов.КассоваяКнигаПредставление + "</a></p>";
				
				
				ВыборкаПоДокументам = ВыборкаКассовыхЛистов.Выбрать();
				Пока ВыборкаПоДокументам.Следующий() Цикл
					НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаПоДокументам.Документ);
					ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0"">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="+НавигационнаяСсылка+">" 
					+ ВыборкаПоДокументам.ДокументПредставление + "</a></p>";
				КонецЦикла;
				
			КонецЦикла;
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	// Дата ПКО или РКО отличается от даты листа кассовой книги.
	Если НЕ ДанныеПроверки[6].Пустой() Тогда
		ТекстHTML = ТекстHTML + "<h3><p style=""margin-bottom: 0""><b>Дата документа отличается от даты листа кассовой книги:</b></p></h3>";
		ВыборкаКассовыхЛистов = ДанныеПроверки[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКассовыхЛистов.Следующий() Цикл
				НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаКассовыхЛистов.КассоваяКнига);
				ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0""><a href="+НавигационнаяСсылка+">" 
				+ ВыборкаКассовыхЛистов.КассоваяКнигаПредставление + "</a></p>";
				
				
				ВыборкаПоДокументам = ВыборкаКассовыхЛистов.Выбрать();
				Пока ВыборкаПоДокументам.Следующий() Цикл
					НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаПоДокументам.Документ);
					ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0"">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="+НавигационнаяСсылка+">" 
					+ ВыборкаПоДокументам.ДокументПредставление + "</a></p>";
				КонецЦикла;
				
			КонецЦикла;
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	// проверки нумерации
	Если НЕ ДанныеПроверки[7].Пустой() Тогда
		
		ВыборкаПоГодам = ДанныеПроверки[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыведенЗаголовок = Ложь;
		
		Пока ВыборкаПоГодам.Следующий() Цикл
			
			ВыборкаПоДокументам = ВыборкаПоГодам.Выбрать();
			НомерЛиста = Неопределено;
			
			СбитаНумерация = Ложь;
			
			Пока ВыборкаПоДокументам.Следующий() Цикл
				
				Если НЕ СбитаНумерация Тогда
					Если НомерЛиста = Неопределено Тогда
						НомерЛиста = ВыборкаПоДокументам.НомерЛиста;
					Иначе
						НомерЛиста = НомерЛиста + 1;
						СбитаНумерация = НЕ ВыборкаПоДокументам.НомерЛиста = НомерЛиста;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СбитаНумерация Тогда
					
					Если НЕ ВыведенЗаголовок Тогда
						ТекстHTML = ТекстHTML + "<h3><p style=""margin-bottom: 0""><b>Документы со сбитой нумерацией:</b></p></h3><A href=""ЗапуститьПеренумерацию"">Перенумеровать</a><p style=""margin-top: 0; margin-bottom: 0"">&nbsp;</p>";
						ВыведенЗаголовок = Истина;
					КонецЕсли;
					
					НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаПоДокументам.КассоваяКнига);
					ТекстHTML = ТекстHTML + "<p style=""margin-top: 0; margin-bottom: 0""><a href="+НавигационнаяСсылка+">" 
					+ ВыборкаПоДокументам.КассоваяКнигаПредставление + НСтр("ru = ', № листа:'") + " " + ВыборкаПоДокументам.НомерЛиста + "</a></p>";
					
					ДокументыКПеренумерации.Добавить(ВыборкаПоДокументам.КассоваяКнига);
					ЕстьОшибки = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЕстьОшибки Тогда
		
		ТекстHTML = ТекстHTML + "<h4><p style=""margin-bottom: 0""><b><font color=""green"">Ошибок не обнаружено</font></b></p></h4>";
		
	КонецЕсли;
	
	ТекстHTML = ТекстHTML + "</body>
	|</html>";
	
	ПолеHTML = ТекстHTML;
	

КонецПроцедуры

&НаСервере
Функция ДанныеПроверки()
	
	// [0] - Временная таблица КассовыеКниги
	// [1] - временная таблица ТаблицаДокументов не сгруппированная
	// [2] - временная таблица ТаблицаДокументов
	// [3] - документы, которые необходимо внести в кассовую книгу
	// [4] - непроведенные ПКО и РКО, которые уже внесены в кассовую книгу
	// [5] - не совпадают суммы в кассовой книге и ПКО или РКО
	// [6] - дата ПКО или РКО отличается от даты листа кассовой книги
	// [7] - таблица для проверки нумерации.
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	КассоваяКнигаКассовыеОрдера.Ссылка,
	|	КассоваяКнигаКассовыеОрдера.КассовыйОрдер
	|ПОМЕСТИТЬ КассовыеКниги
	|ИЗ
	|	Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнигаКассовыеОрдера
	|ГДЕ
	|	КассоваяКнигаКассовыеОрдера.Ссылка.Проведен
	|	И КассоваяКнигаКассовыеОрдера.Ссылка.Организация = &Организация
	|	И КассоваяКнигаКассовыеОрдера.Ссылка.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	%УсловиеМагазин%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	РасходныйКассовыйОрдер.Дата КАК Дата
	|ПОМЕСТИТЬ ТаблицаДокументовПредварительная
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассовыеКниги КАК КассоваяКнигаДокументы
	|		ПО РасходныйКассовыйОрдер.Ссылка = КассоваяКнигаДокументы.КассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасходныйКассовыйОрдер.Организация = &Организация
	|	И РасходныйКассовыйОрдер.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	%УсловиеМагазин1%
	|	И КассоваяКнигаДокументы.Ссылка ЕСТЬ NULL 
	|	И ВЫБОР
	|			КОГДА &Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				ТОГДА НЕ РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|						ТОГДА НЕ РасходныйКассовыйОрдер.Касса.Магазин = РасходныйКассовыйОрдер.КассаПолучатель.Магазин
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка,
	|	РасходныйКассовыйОрдер.Ссылка.Дата
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассовыеКниги КАК КассоваяКнигаДокументы
	|		ПО РасходныйКассовыйОрдер.Ссылка = КассоваяКнигаДокументы.КассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка.Проведен
	|	И РасходныйКассовыйОрдер.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасходныйКассовыйОрдер.Ссылка.Организация = &Организация
	|	И РасходныйКассовыйОрдер.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	%УсловиеМагазин2%
	|	И КассоваяКнигаДокументы.Ссылка ЕСТЬ NULL 
	|	И ВЫБОР
	|			КОГДА &Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				ТОГДА НЕ РасходныйКассовыйОрдер.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РасходныйКассовыйОрдер.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|						ТОГДА НЕ РасходныйКассовыйОрдер.Ссылка.Касса.Магазин = РасходныйКассовыйОрдер.Ссылка.КассаПолучатель.Магазин
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассовыеКниги КАК КассоваяКнигаДокументы
	|		ПО ПриходныйКассовыйОрдер.Ссылка = КассоваяКнигаДокументы.КассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен
	|	И ПриходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПриходныйКассовыйОрдер.Организация = &Организация
	|	И ПриходныйКассовыйОрдер.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	%УсловиеМагазин3%
	|	И КассоваяКнигаДокументы.Ссылка ЕСТЬ NULL 
	|	И ВЫБОР
	|			КОГДА &Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				ТОГДА НЕ ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы)
	|						ТОГДА НЕ ПриходныйКассовыйОрдер.ДокументОснование.Касса.Магазин = ПриходныйКассовыйОрдер.Касса.Магазин
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументовПредварительная.Ссылка КАК Ссылка,
	|	ТаблицаДокументовПредварительная.Дата КАК Дата
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	ТаблицаДокументовПредварительная КАК ТаблицаДокументовПредварительная
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументовПредварительная.Ссылка,
	|	ТаблицаДокументовПредварительная.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументов.Ссылка) КАК Представление
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокументов.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КассоваяКнигаДокументы.Ссылка КАК КассоваяКнига,
	|	КассоваяКнигаДокументы.КассовыйОрдер КАК Документ,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.Ссылка) КАК КассоваяКнигаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.КассовыйОрдер) КАК ДокументПредставление
	|ИЗ
	|	Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнигаДокументы
	|ГДЕ
	|	КассоваяКнигаДокументы.Ссылка.Проведен
	|	И КассоваяКнигаДокументы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ КассоваяКнигаДокументы.КассовыйОрдер.Проведен
	|	И КассоваяКнигаДокументы.Ссылка.Организация = &Организация
	|	И КассоваяКнигаДокументы.Ссылка.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	И КассоваяКнигаДокументы.Ссылка.Магазин = &Магазин
	|ИТОГИ ПО
	|	КассоваяКнига
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КассоваяКнигаДокументы.Ссылка КАК КассоваяКнига,
	|	КассоваяКнигаДокументы.КассовыйОрдер КАК Документ,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.Ссылка) КАК КассоваяКнигаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.КассовыйОрдер) КАК ДокументПредставление
	|ИЗ
	|	Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнигаДокументы
	|ГДЕ
	|	КассоваяКнигаДокументы.Ссылка.Проведен
	|	И КассоваяКнигаДокументы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ КассоваяКнигаДокументы.КассовыйОрдер.СуммаДокумента = КассоваяКнигаДокументы.Приход
	|	И НЕ КассоваяКнигаДокументы.КассовыйОрдер.СуммаДокумента = КассоваяКнигаДокументы.Расход
	|	И КассоваяКнигаДокументы.Ссылка.Организация = &Организация
	|	И КассоваяКнигаДокументы.Ссылка.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	И КассоваяКнигаДокументы.Ссылка.Магазин = &Магазин
	|ИТОГИ ПО
	|	КассоваяКнига
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КассоваяКнигаДокументы.Ссылка КАК КассоваяКнига,
	|	КассоваяКнигаДокументы.КассовыйОрдер КАК Документ,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.Ссылка) КАК КассоваяКнигаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.КассовыйОрдер) КАК ДокументПредставление
	|ИЗ
	|	Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнигаДокументы
	|ГДЕ
	|	КассоваяКнигаДокументы.Ссылка.Проведен
	|	И КассоваяКнигаДокументы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ(КассоваяКнигаДокументы.КассовыйОрдер.Дата МЕЖДУ НАЧАЛОПЕРИОДА(КассоваяКнигаДокументы.Ссылка.Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(КассоваяКнигаДокументы.Ссылка.Дата, ДЕНЬ))
	|	И КассоваяКнигаДокументы.Ссылка.Организация = &Организация
	|	И КассоваяКнигаДокументы.Ссылка.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	И КассоваяКнигаДокументы.Ссылка.Магазин = &Магазин
	|ИТОГИ ПО
	|	КассоваяКнига
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГОД(КассоваяКнигаДокументы.Ссылка.Дата) КАК Год,
	|	КассоваяКнигаДокументы.Ссылка КАК КассоваяКнига,
	|	ПРЕДСТАВЛЕНИЕ(КассоваяКнигаДокументы.Ссылка) КАК КассоваяКнигаПредставление,
	|	КассоваяКнигаДокументы.НомерЛиста КАК НомерЛиста,
	|	КассоваяКнигаДокументы.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнигаДокументы
	|ГДЕ
	|	КассоваяКнигаДокументы.Ссылка.Организация = &Организация
	|	И КассоваяКнигаДокументы.Ссылка.ДоговорПлатежногоАгента = &ДоговорПлатежногоАгента
	|	И КассоваяКнигаДокументы.Ссылка.Магазин = &Магазин
	|	И КассоваяКнигаДокументы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КассоваяКнигаДокументы.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерЛиста
	|ИТОГИ ПО
	|	Год";
	
	Если ЗначениеЗаполнено(Магазин) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин%" , "И КассоваяКнигаКассовыеОрдера.Ссылка.Магазин = &Магазин");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин1%", "И РасходныйКассовыйОрдер.Касса.Магазин = &Магазин");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин2%", "И РасходныйКассовыйОрдер.Ссылка.Касса.Магазин = &Магазин");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин3%", "И ПриходныйКассовыйОрдер.Касса.Магазин = &Магазин");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин%" , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин1%", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин2%", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин3%", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорПлатежногоАгента", ДоговорПлатежногоАгента);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("НачалоПериода", ПериодПроверки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПроверки.ДатаОкончания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьПеренумерацию()
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Перенумерация'"),
		,
		НСтр("ru='Начата перенумерация листов кассовой книги'"),
		БиблиотекаКартинок.Обновить);
	
	Если ЗапуститьПеренумерациюСервер() Тогда
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Перенумерация'"),
			,
			НСтр("ru='Перенумерация успешно завершена'"),
			БиблиотекаКартинок.Обновить);
		
	Иначе
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Перенумерация'"),
			,
			НСтр("ru='Перенумерация прервана с ошибкой'"),
			БиблиотекаКартинок.Обновить);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьПеренумерациюСервер()
	
	НетОшибок = Истина;
	
	НачатьТранзакцию();
	Для Каждого КассоваяКнигаСсылка Из ДокументыКПеренумерации Цикл
		
		КассоваяКнигаОбъект = КассоваяКнигаСсылка.Значение.ПолучитьОбъект();
		КассоваяКнигаОбъект.ЗаполнитьНомераЛистов();
		Попытка
			КассоваяКнигаОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			НетОшибок = Ложь;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Если НетОшибок Тогда
		
		Попытка
			ЗафиксироватьТранзакцию();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат НетОшибок;
	
КонецФункции

&НаКлиенте
Процедура УстановитьНеАктуальностьРасчетов()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТабДок;
	
	Элементы.ТабДок.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.ТабДок.ОтображениеСостояния.Текст = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'");
	Элементы.ТабДок.ОтображениеСостояния.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти
